<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class ProductsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {


        \DB::table('products')->delete();

        \DB::table('products')->insert(array (
            0 =>
            array (
                'id' => 1,
                'name' => 'خرید آیفون ۱۷ اپل، قیمت تمام مدل های گوشی iphone 17',
                'price' => 307999000,
                'discount' => 0,
                'short_description' => 'خرید آیفون ۱۷ اپل، قیمت تمام مدل های گوشی iphone 17',
                'long_description' => 'لیست قیمت آیفون ۱۷ دیجی کالا؛ برای مشاهده عکس، مشخصات، مقایسه تمام مدل ها و خرید گوشی های آیفون 17 روی لینک بالا بزنید.
',
                'stock' => 10,
                'featured' => 1,
                'discount_duration' => '2025-10-16 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'created_at' => '2025-10-10 20:33:59',
                'updated_at' => '2025-10-10 20:33:59',
                'p_code' => 'dkp-20125788',
            ),
            1 =>
            array (
                'id' => 2,
                'name' => 'گوشی موبایل اپل مدل iPhone 16e ZAA دو سیم کارت ظرفیت 128 گیگابایت و رم 8 گیگابایت',
                'price' => 76800000,
                'discount' => 4,
                'short_description' => 'خرید اینترنتی گوشی موبایل اپل مدل iPhone 16e ZAA دو سیم کارت ظرفیت 128 گیگابایت و رم 8 گیگابایت به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا',
                'long_description' => 'خرید اینترنتی گوشی موبایل اپل مدل iPhone 16e ZAA دو سیم کارت ظرفیت 128 گیگابایت و رم 8 گیگابایت به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 3,
                'featured' => 1,
                'discount_duration' => '2025-10-30 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'created_at' => '2025-10-10 21:10:53',
                'updated_at' => '2025-10-10 21:10:53',
                'p_code' => 'dkp-20125088',
            ),
            2 =>
            array (
                'id' => 3,
                'name' => 'گوشی موبایل آنر مدل X8c دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت',
                'price' => 20500000,
                'discount' => 10,
                'short_description' => 'خرید اینترنتی گوشی موبایل آنر مدل X8c دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت با رنگبندی مشکی، سفید، سبز به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا',
                'long_description' => 'خرید اینترنتی گوشی موبایل آنر مدل X8c دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت با رنگبندی مشکی، سفید، سبز به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 3,
                'featured' => 0,
                'discount_duration' => '2025-10-29 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'created_at' => '2025-10-10 21:17:10',
                'updated_at' => '2025-10-10 21:17:10',
                'p_code' => 'dkp-201788',
            ),
            3 =>
            array (
                'id' => 4,
                'name' => 'گوشی شیائومی Redmi Note 14 4G رجیستر‌شده دو سیم‌کارت 256 گیگابایت با رم 8 گیگابایت',
                'price' => 185000000,
                'discount' => 3,
                'short_description' => 'خرید اینترنتی گوشی موبایل شیائومی مدل Redmi Note 14 4G دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت با رنگبندی مشکی، سبز، آبی، بنفش، طلایی به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا',
                'long_description' => 'خرید اینترنتی گوشی موبایل شیائومی مدل Redmi Note 14 4G دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت با رنگبندی مشکی، سبز، آبی، بنفش، طلایی به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 20,
                'featured' => 1,
                'discount_duration' => '2025-10-01 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'created_at' => '2025-10-10 21:20:11',
                'updated_at' => '2025-10-10 21:20:11',
                'p_code' => 'dkp-201257088',
            ),
            4 =>
            array (
                'id' => 5,
                'name' => 'گوشی موبایل سامسونگ مدل Galaxy A10 SM-A105F/DS دو سیم کارت ظرفیت 32 گیگابایت',
                'price' => 93990000,
                'discount' => 20,
                'short_description' => 'خرید آنلاین ، عکس ، قیمت و مشخصات گوشی a10 سامسونگ در فروشگاه اینترنتی دیجی کالا',
                'long_description' => 'خرید آنلاین ، عکس ، قیمت و مشخصات گوشی a10 سامسونگ در فروشگاه اینترنتی دیجی کالا
',
                'stock' => 6,
                'featured' => 1,
                'discount_duration' => '2025-10-23 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'created_at' => '2025-10-10 21:22:51',
                'updated_at' => '2025-10-10 21:22:51',
                'p_code' => 'dkp-125788',
            ),
            5 =>
            array (
                'id' => 6,
                'name' => 'گوشی شیائومی Redmi Note 13 Pro 5G رجیستر‌شده دو سیم‌کارت 512 گیگابایت با رم 12 گیگابایت',
                'price' => 307000000,
                'discount' => 0,
                'short_description' => 'گوشی شیائومی Redmi Note 13 Pro 5G رجیستر‌شده دو سیم‌کارت 512 گیگابایت با رم 12 گیگابایت',
                'long_description' => 'خرید اینترنتی گوشی موبایل شیائومی مدل Redmi Note 13 Pro 5G دو سیم کارت ظرفیت 512 گیگابایت و رم 12 گیگابایت با رنگبندی بنفش، مشکی به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 20,
                'featured' => 0,
                'discount_duration' => '2025-10-29 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'created_at' => '2025-10-10 21:26:14',
                'updated_at' => '2025-10-10 21:26:14',
                'p_code' => 'dkp-201578',
            ),
            6 =>
            array (
                'id' => 7,
                'name' => 'قیمت و خرید گوشی موبایل هوآوی مدل Y9s STK-L21 دو سیم کارت ظرفیت 128 گیگابایت',
                'price' => 20000000,
                'discount' => 0,
                'short_description' => 'خرید اینترنتی گوشی موبایل هوآوی مدل Y9s STK-L21 دو سیم کارت ظرفیت 128 گیگابایت به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا',
                'long_description' => 'خرید اینترنتی گوشی موبایل هوآوی مدل Y9s STK-L21 دو سیم کارت ظرفیت 128 گیگابایت به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 0,
                'featured' => 0,
                'discount_duration' => '2025-10-08 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'created_at' => '2025-10-10 21:29:40',
                'updated_at' => '2025-10-10 21:29:40',
                'p_code' => 'dkp-20188788',
            ),
            7 =>
            array (
                'id' => 8,
                'name' => 'هندزفری بلوتوثی بیرداینامیک مدل AMIRON 300',
                'price' => 48000000,
                'discount' => 10,
                'short_description' => 'خرید اینترنتی هندزفری بلوتوثی بیرداینامیک مدل AMIRON 300 با رنگبندی مشکی، کرم به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا',
                'long_description' => 'خرید اینترنتی هندزفری بلوتوثی بیرداینامیک مدل AMIRON 300 با رنگبندی مشکی، کرم به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 30,
                'featured' => 0,
                'discount_duration' => '2025-10-23 00:00:00',
                'seller_id' => 1,
                'category_id' => 5,
                'created_at' => '2025-10-10 21:32:19',
                'updated_at' => '2025-10-10 21:32:19',
                'p_code' => 'dkp-2088',
            ),
            8 =>
            array (
                'id' => 9,
                'name' => 'هدفون بلوتوثی سوموس تل مدل YAS-SH24',
                'price' => 15004200,
                'discount' => 10,
                'short_description' => 'خرید اینترنتی هدفون بلوتوثی سوموس تل مدل YAS-SH24 با رنگبندی نقره ای به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا',
                'long_description' => 'خرید اینترنتی هدفون بلوتوثی سوموس تل مدل YAS-SH24 با رنگبندی نقره ای به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 40,
                'featured' => 1,
                'discount_duration' => '2025-10-02 00:00:00',
                'seller_id' => 1,
                'category_id' => 5,
                'created_at' => '2025-10-10 21:35:14',
                'updated_at' => '2025-10-10 21:35:14',
                'p_code' => 'dkp-25555788',
            ),
            9 =>
            array (
                'id' => 10,
                'name' => 'قیمت و خرید تلویزیون ال ای دی هوشمند جی پلاس مدل GTV-50MU722S سایز 50 اینچ',
                'price' => 24800000,
                'discount' => 20,
                'short_description' => 'قیمت و خرید تلویزیون ال ای دی هوشمند جی پلاس مدل GTV-50MU722S سایز 50 اینچ',
                'long_description' => 'خرید اینترنتی تلویزیون ال ای دی هوشمند جی پلاس مدل GTV-50MU722S سایز 50 اینچ به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 4,
                'featured' => 1,
                'discount_duration' => '2025-10-30 00:00:00',
                'seller_id' => 1,
                'category_id' => 3,
                'created_at' => '2025-10-10 21:37:46',
                'updated_at' => '2025-10-10 21:37:46',
                'p_code' => 'dkp-20124508',
            ),
            10 =>
            array (
                'id' => 11,
                'name' => 'قیمت و خرید تلویزیون کیو ال ای دی هوشمند تی سی ال مدل 65C655 سایز 65 اینچ',
                'price' => 5980000000,
                'discount' => 10,
                'short_description' => 'قیمت و خرید تلویزیون کیو ال ای دی هوشمند تی سی ال مدل 65C655 سایز 65 اینچ',
                'long_description' => 'تلویزیون گیمینگ کیو ال ای دی QLED تی سی ال مدل 65C655 سایز 65 اینچ با کیفیت تصویر 4K، سیستم‌عامل Android 12، دارای پشتیبانی از زیرنویس فارسی، قابلیت Time Shift، Screen Mirroring، پنل VA، حداکثر نرخ به‌روزرسانی 60 هرتز، پشتیبانی از HDR10 و Dolby Vision
',
                'stock' => 20,
                'featured' => 1,
                'discount_duration' => '2025-10-31 00:00:00',
                'seller_id' => 1,
                'category_id' => 3,
                'created_at' => '2025-10-10 21:40:11',
                'updated_at' => '2025-10-10 21:40:11',
                'p_code' => 'dkp-20125700',
            ),
            11 =>
            array (
                'id' => 12,
                'name' => 'قیمت و خرید گوشی موبایل اپل مدل iPhone 16 Plus CH دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت - رجیستر شده',
                'price' => 8000000,
                'discount' => 0,
                'short_description' => 'خرید اینترنتی گوشی موبایل اپل مدل iPhone 16 Plus CH دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت - رجیستر شده به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا',
                'long_description' => 'خرید اینترنتی گوشی موبایل اپل مدل iPhone 16 Plus CH دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت - رجیستر شده به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 5,
                'featured' => 1,
                'discount_duration' => '2025-10-09 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'created_at' => '2025-10-10 21:42:39',
                'updated_at' => '2025-10-10 21:42:39',
                'p_code' => 'dkp-208',
            ),
        ));


    }
}
