<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class ProductsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('products')->delete();
        
        \DB::table('products')->insert(array (
            0 => 
            array (
                'id' => 1,
                'name' => 'آیفون ۱۷ اپل، قیمت تمام مدل های گوشی iphone 17',
                'price' => 307999000,
                'discount' => 0,
                'short_description' => 'خرید آیفون ۱۷ اپل، قیمت تمام مدل های گوشی iphone 17',
                'long_description' => 'لیست قیمت آیفون ۱۷ دیجی کالا؛ برای مشاهده عکس، مشخصات، مقایسه تمام مدل ها و خرید گوشی های آیفون 17 روی لینک بالا بزنید.
',
                'stock' => 10,
                'featured' => 1,
                'discount_duration' => '2025-10-16 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'p_code' => 'dkp-639586',
                'deleted_at' => NULL,
                'created_at' => '2025-10-10 20:33:59',
                'updated_at' => '2025-10-21 09:59:16',
            ),
            1 => 
            array (
                'id' => 2,
                'name' => 'گوشی موبایل اپل مدل iPhone 16e ZAA دو سیم کارت ظرفیت 128 گیگابایت و رم 8 گیگابایت',
                'price' => 76800000,
                'discount' => 4,
                'short_description' => 'خرید اینترنتی گوشی موبایل اپل مدل iPhone 16e ZAA دو سیم کارت ظرفیت 128 گیگابایت و رم 8 گیگابایت به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا',
                'long_description' => 'خرید اینترنتی گوشی موبایل اپل مدل iPhone 16e ZAA دو سیم کارت ظرفیت 128 گیگابایت و رم 8 گیگابایت به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 3,
                'featured' => 1,
                'discount_duration' => '2025-10-30 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'p_code' => 'dkp-20125088',
                'deleted_at' => NULL,
                'created_at' => '2025-10-10 21:10:53',
                'updated_at' => '2025-10-10 21:10:53',
            ),
            2 => 
            array (
                'id' => 3,
                'name' => 'گوشی موبایل آنر مدل X8c دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت',
                'price' => 20500000,
                'discount' => 10,
                'short_description' => 'خرید اینترنتی گوشی موبایل آنر مدل X8c دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت با رنگبندی مشکی، سفید، سبز به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا',
                'long_description' => 'خرید اینترنتی گوشی موبایل آنر مدل X8c دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت با رنگبندی مشکی، سفید، سبز به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 3,
                'featured' => 0,
                'discount_duration' => '2025-10-29 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'p_code' => 'dkp-201788',
                'deleted_at' => NULL,
                'created_at' => '2025-10-10 21:17:10',
                'updated_at' => '2025-10-10 21:17:10',
            ),
            3 => 
            array (
                'id' => 4,
                'name' => 'گوشی شیائومی Redmi Note 14 4G رجیستر‌شده دو سیم‌کارت 256 گیگابایت با رم 8 گیگابایت',
                'price' => 185000000,
                'discount' => 3,
                'short_description' => 'خرید اینترنتی گوشی موبایل شیائومی مدل Redmi Note 14 4G دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت با رنگبندی مشکی، سبز، آبی، بنفش، طلایی به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا',
                'long_description' => 'خرید اینترنتی گوشی موبایل شیائومی مدل Redmi Note 14 4G دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت با رنگبندی مشکی، سبز، آبی، بنفش، طلایی به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 20,
                'featured' => 1,
                'discount_duration' => '2025-10-01 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'p_code' => 'dkp-201257088',
                'deleted_at' => NULL,
                'created_at' => '2025-10-10 21:20:11',
                'updated_at' => '2025-10-10 21:20:11',
            ),
            4 => 
            array (
                'id' => 5,
                'name' => 'گوشی موبایل سامسونگ مدل Galaxy A10 SM-A105F/DS دو سیم کارت ظرفیت 32 گیگابایت',
                'price' => 93990000,
                'discount' => 20,
                'short_description' => 'خرید آنلاین ، عکس ، قیمت و مشخصات گوشی a10 سامسونگ در فروشگاه اینترنتی دیجی کالا',
                'long_description' => 'خرید آنلاین ، عکس ، قیمت و مشخصات گوشی a10 سامسونگ در فروشگاه اینترنتی دیجی کالا
',
                'stock' => 6,
                'featured' => 1,
                'discount_duration' => '2025-10-23 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'p_code' => 'dkp-125788',
                'deleted_at' => NULL,
                'created_at' => '2025-10-10 21:22:51',
                'updated_at' => '2025-10-10 21:22:51',
            ),
            5 => 
            array (
                'id' => 6,
                'name' => 'گوشی شیائومی Redmi Note 13 Pro 5G رجیستر‌شده دو سیم‌کارت 512 گیگابایت با رم 12 گیگابایت',
                'price' => 307000000,
                'discount' => 0,
                'short_description' => 'گوشی شیائومی Redmi Note 13 Pro 5G رجیستر‌شده دو سیم‌کارت 512 گیگابایت با رم 12 گیگابایت',
                'long_description' => 'خرید اینترنتی گوشی موبایل شیائومی مدل Redmi Note 13 Pro 5G دو سیم کارت ظرفیت 512 گیگابایت و رم 12 گیگابایت با رنگبندی بنفش، مشکی به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 20,
                'featured' => 0,
                'discount_duration' => '2025-10-29 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'p_code' => 'dkp-201578',
                'deleted_at' => NULL,
                'created_at' => '2025-10-10 21:26:14',
                'updated_at' => '2025-10-10 21:26:14',
            ),
            6 => 
            array (
                'id' => 7,
                'name' => 'گوشی موبایل هوآوی مدل Y9s STK-L21 دو سیم کارت ظرفیت 128 گیگابایت',
                'price' => 20000000,
                'discount' => 0,
                'short_description' => 'خرید اینترنتی گوشی موبایل هوآوی مدل Y9s STK-L21 دو سیم کارت ظرفیت 128 گیگابایت به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا',
                'long_description' => 'خرید اینترنتی گوشی موبایل هوآوی مدل Y9s STK-L21 دو سیم کارت ظرفیت 128 گیگابایت به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 0,
                'featured' => 0,
                'discount_duration' => '2025-10-08 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'p_code' => 'dkp-39252',
                'deleted_at' => NULL,
                'created_at' => '2025-10-10 21:29:40',
                'updated_at' => '2025-10-21 09:59:01',
            ),
            7 => 
            array (
                'id' => 8,
                'name' => 'هندزفری بلوتوثی بیرداینامیک مدل AMIRON 300',
                'price' => 48000000,
                'discount' => 10,
                'short_description' => 'خرید اینترنتی هندزفری بلوتوثی بیرداینامیک مدل AMIRON 300 با رنگبندی مشکی، کرم به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا',
                'long_description' => 'خرید اینترنتی هندزفری بلوتوثی بیرداینامیک مدل AMIRON 300 با رنگبندی مشکی، کرم به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 30,
                'featured' => 0,
                'discount_duration' => '2025-10-23 00:00:00',
                'seller_id' => 1,
                'category_id' => 5,
                'p_code' => 'dkp-2088',
                'deleted_at' => NULL,
                'created_at' => '2025-10-10 21:32:19',
                'updated_at' => '2025-10-10 21:32:19',
            ),
            8 => 
            array (
                'id' => 9,
                'name' => 'هدفون بلوتوثی سوموس تل مدل YAS-SH24',
                'price' => 15004200,
                'discount' => 10,
                'short_description' => 'خرید اینترنتی هدفون بلوتوثی سوموس تل مدل YAS-SH24 با رنگبندی نقره ای به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا',
                'long_description' => 'خرید اینترنتی هدفون بلوتوثی سوموس تل مدل YAS-SH24 با رنگبندی نقره ای به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 40,
                'featured' => 1,
                'discount_duration' => '2025-10-02 00:00:00',
                'seller_id' => 1,
                'category_id' => 5,
                'p_code' => 'dkp-25555788',
                'deleted_at' => NULL,
                'created_at' => '2025-10-10 21:35:14',
                'updated_at' => '2025-10-10 21:35:14',
            ),
            9 => 
            array (
                'id' => 10,
                'name' => 'تلویزیون ال ای دی هوشمند جی پلاس مدل GTV-50MU722S سایز 50 اینچ',
                'price' => 24800000,
                'discount' => 20,
                'short_description' => 'قیمت و خرید تلویزیون ال ای دی هوشمند جی پلاس مدل GTV-50MU722S سایز 50 اینچ',
                'long_description' => 'خرید اینترنتی تلویزیون ال ای دی هوشمند جی پلاس مدل GTV-50MU722S سایز 50 اینچ به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'stock' => 4,
                'featured' => 1,
                'discount_duration' => '2025-10-30 00:00:00',
                'seller_id' => 1,
                'category_id' => 3,
                'p_code' => 'dkp-597347',
                'deleted_at' => NULL,
                'created_at' => '2025-10-10 21:37:46',
                'updated_at' => '2025-10-21 09:58:47',
            ),
            10 => 
            array (
                'id' => 11,
                'name' => 'تلویزیون کیو ال ای دی هوشمند تی سی ال مدل 65C655 سایز 65 اینچ',
                'price' => 5980000000,
                'discount' => 10,
                'short_description' => 'قیمت و خرید تلویزیون کیو ال ای دی هوشمند تی سی ال مدل 65C655 سایز 65 اینچ',
                'long_description' => 'تلویزیون گیمینگ کیو ال ای دی QLED تی سی ال مدل 65C655 سایز 65 اینچ با کیفیت تصویر 4K، سیستم‌عامل Android 12، دارای پشتیبانی از زیرنویس فارسی، قابلیت Time Shift، Screen Mirroring، پنل VA، حداکثر نرخ به‌روزرسانی 60 هرتز، پشتیبانی از HDR10 و Dolby Vision
',
                'stock' => 20,
                'featured' => 1,
                'discount_duration' => '2025-10-31 00:00:00',
                'seller_id' => 1,
                'category_id' => 3,
                'p_code' => 'dkp-924675',
                'deleted_at' => NULL,
                'created_at' => '2025-10-10 21:40:11',
                'updated_at' => '2025-10-21 09:58:35',
            ),
            11 => 
            array (
                'id' => 12,
                'name' => 'گوشی موبایل اپل مدل iPhone 16 Plus CH دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت - رجیستر شده',
                'price' => 8000000,
                'discount' => 0,
                'short_description' => 'گوشی موبایل اپل مدل iPhone 16 Plus CH دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت - رجیستر شده',
                'long_description' => '<p style="text-align:justify"><span style="font-family:Tahoma,Geneva,sans-serif"><span style="font-size:16px"><strong>گوشی موبایل اپل مدل iPhone 16، به عنوان یکی از جدیدترین مدل&zwnj;های این برند معتبر، با طراحی مدرن و ویژگی&zwnj;های پیشرفته، تجربه&zwnj;ای بی&zwnj;نظیر از دنیای تکنولوژی را برای کاربران فراهم می&zwnj;کند. این گوشی با ظرفیت 128 گیگابایت و رم 8 گیگابایت، عملکردی سریع و روان را ارائه می&zwnj;دهد که به راحتی از پس کارهای روزمره و multitasking برمی&zwnj;آید. طراحی این دستگاه با دقت و ظرافت بالا انجام شده و بدنه آن از مواد با کیفیت ساخته شده است که حس لوکس بودن را به کاربر منتقل می&zwnj;کند. قابلیت پشتیبانی از دو سیم کارت، امکان استفاده همزمان از دو شماره تلفن را برای کاربران فراهم می&zwnj;کند که این ویژگی به&zwnj;خصوص برای افرادی که به دو شماره مختلف برای کار و زندگی شخصی نیاز دارند بسیار مفید است. دوربین&zwnj;های با کیفیت iPhone 16،</strong></span></span></p>

<p style="text-align:justify"><span style="font-family:Tahoma,Geneva,sans-serif"><span style="font-size:16px"><strong><img alt="" src="http://127.0.0.1:8000/products/12/content/QdW4DDX3xJRkoru6QJwZwnjI45M2Vf0nM60pl74X.webp" style="height:500px; width:500px" /> تجربه عکاسی فوق&zwnj;العاده&zwnj;ای را ارائه می&zwnj;دهند و با فناوری&zwnj;های نوین، امکان ثبت لحظات خاص با جزئیات بالا را فراهم می&zwnj;کنند. همچنین، باتری با عمر طولانی و قابلیت&zwnj;های شارژ سریع، این اطمینان را به شما می&zwnj;دهد که می&zwnj;توانید در طول روز به راحتی از گوشی خودتان استفاده کنید. به&zwnj;طور کلی، iPhone 16 یک انتخاب عالی برای کسانی است که به دنبال ترکیبی از کیفیت، قدرت و طراحی مدرن هستند. همانطور که می&zwnj;دانید گوشی&zwnj;های آیفون با پارت نامبرهای مختلفی از جمله CH، ZAA، LLAT ZPAو ... در بازار وجود دارند. پارت نامبر CH مربوط به کشور چین است که تفاوت خاصی با دیگر پارت نامبرها ندارند و تنها در مورد استفاده از تماس&zwnj;های صوتی و تماس&zwnj;های گروهی در نرم افزار فیس تایم شامل محدودیت است. این پارت نامبر از دو سیم&zwnj;کارت فیزیکی پشتیبانی می&zwnj;کند که یک نکته مثبت محسوب می&zwnj;شود. این گوشی، مانند تمامی گوشی&zwnj;های عرضه&zwnj;شده در دیجی&zwnj;کالا، به صورت قانونی و تجاری وارد کشور شده و با رجیستر رسمی، کارت گارانتی معتبر و کد فعال&zwnj;سازی به شما تحویل داده می&zwnj;شود.</strong></span></span></p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<h1>&nbsp;</h1>
',
                'stock' => 5,
                'featured' => 1,
                'discount_duration' => '2025-10-09 00:00:00',
                'seller_id' => 1,
                'category_id' => 1,
                'p_code' => 'dkp-539456',
                'deleted_at' => NULL,
                'created_at' => '2025-10-10 21:42:39',
                'updated_at' => '2025-10-25 23:42:09',
            ),
            12 => 
            array (
                'id' => 13,
                'name' => 'Nathaniel Holder',
                'price' => 104,
                'discount' => 567,
                'short_description' => 'گوشی موبایل اپل مدل iPhone 16، به عنوان یکی از جدیدترین مدل‌های این برند معتبر، با طراحی مدرن و ویژگی‌های پیشرفته، تجربه‌ای بی‌نظیر از دنیای تکنولوژی را برای کاربران فراهم می‌کند. این گوشی با ظرفیت 128 گیگابایت و رم 8 گیگابایت، عملکردی سریع و روان را ارائه می‌دهد که به راحتی از پس کارهای روزمره و multitasking برمی‌آید. طراحی این دستگاه با دقت و ظرافت بالا انجام شده و بدنه آن از مواد با کیفیت ساخته شده است که حس لوکس بودن را به کاربر منتقل می‌کند. قابلیت پشتیبانی از دو سیم کارت، امکان استفاده همزمان از دو شماره تلفن را برای کاربران فراهم می‌کند که این ویژگی به‌خصوص برای افرادی که به دو شماره مختلف برای کار و زندگی شخصی نیاز دارند بسیار مفید است. دوربین‌های با کیفیت iPhone 16، تجربه عکاسی فوق‌العاده‌ای را ارائه می‌دهند و با فناوری‌های نوین، امکان ثبت لحظات خاص با جزئیات بالا را فراهم می‌کنند. همچنین، باتری با عمر طولانی و قابلیت‌های شارژ سریع، این اطمینان را به شما می‌دهد که می‌توانید در طول روز به راحتی از گوشی خودتان استفاده کنید. به‌طور کلی، iPhone 16 یک انتخاب عالی برای کسانی است که به دنبال ترکیبی از کیفیت، قدرت و طراحی مدرن هستند. همانطور که می‌دانید گوشی‌های آیفون با پارت نامبرهای مختلفی از جمله CH، ZAA، LLAT ZPAو ... در بازار وجود دارند. پارت نامبر CH مربوط به کشور چین است که تفاوت خاصی با دیگر پارت نامبرها ندارند و تنها در مورد استفاده از تماس‌های صوتی و تماس‌های گروهی در نرم افزار فیس تایم شامل محدودیت است. این پارت نامبر از دو سیم‌کارت فیزیکی پشتیبانی می‌کند که یک نکته مثبت محسوب می‌شود. این گوشی، مانند تمامی گوشی‌های عرضه‌شده در دیجی‌کالا، به صورت قانونی و تجاری وارد کشور شده و با رجیستر رسمی، کارت گارانتی معتبر و کد فعال‌سازی به شما تحویل داده می‌شود',
                'long_description' => '<p><strong>گوشی موبایل اپل مدل iPhone 16، به عنوان یکی از جدیدترین مدل&zwnj;های این برند معتبر، با طراحی مدرن و ویژگی&zwnj;های پیشرفته، تجربه&zwnj;ای بی&zwnj;نظیر از دنیای تکنولوژی را برای کاربران فراهم می&zwnj;کند. این گوشی با ظرفیت 128 گیگابایت و رم 8 گیگابایت، عملکردی سریع و روان را ارائه می&zwnj;دهد</strong></p>

<p><img alt="" src="http://127.0.0.1:8000/products/13/content/IrVaEwiQWZJwoBhP9w28n2Gdh0koAXiDh71UnBXq.webp" style="height:400px; width:400px" /></p>

<p>گوشی موبایل اپل مدل iPhone 16، به عنوان یکی از جدیدترین مدل&zwnj;های این برند معتبر، با طراحی مدرن و ویژگی&zwnj;های پیشرفته، تجربه&zwnj;ای بی&zwnj;نظیر از دنیای تکنولوژی را برای کاربران فراهم می&zwnj;کند. این گوشی با ظرفیت 128 گیگابایت و رم 8 گیگابایت، عملکردی سریع و روان را ارائه می&zwnj;دهد که به راحتی از پس کارهای روزمره و multitasking برمی&zwnj;آید. طراحی این دستگاه با دقت و ظرافت بالا انجام شده و بدنه آن از مواد با کیفیت ساخته شده است که حس لوکس بودن را به کاربر منتقل می&zwnj;کند. قابلیت پشتیبانی از دو سیم کارت، امکان استفاده همزمان از دو شماره تلفن را برای کاربران فراهم می&zwnj;کند که این ویژگی به&zwnj;خصوص برای افرادی که به دو شماره مختلف برای کار و زندگی شخصی نیاز دارند بسیار مفید است. دوربین&zwnj;های با کیفیت iPhone 16، تجربه عکاسی فوق&zwnj;العاده&zwnj;ای را ارائه می&zwnj;دهند و با فناوری&zwnj;های نوین، امکان ثبت لحظات خاص با جزئیات بالا را فراهم می&zwnj;کنند. همچنین، باتری با عمر طولانی و قابلیت&zwnj;های شارژ سریع، این اطمینان را به شما می&zwnj;دهد که می&zwnj;توانید در طول روز به راحتی از گوشی خودتان استفاده کنید. به&zwnj;طور کلی، iPhone 16 یک انتخاب عالی برای کسانی است که به دنبال ترکیبی از کیفیت، قدرت و طراحی مدرن هستند. همانطور که می&zwnj;دانید گوشی&zwnj;های آیفون با پارت نامبرهای مختلفی از جمله CH، ZAA، LLAT ZPAو ... در بازار وجود دارند. پارت نامبر CH مربوط به کشور چین است که تفاوت خاصی با دیگر پارت نامبرها ندارند و تنها در مورد استفاده از تماس&zwnj;های صوتی و تماس&zwnj;های گروهی در نرم افزار فیس تایم شامل محدودیت است. این پارت نامبر از دو سیم&zwnj;کارت فیزیکی پشتیبانی می&zwnj;کند که یک نکته مثبت محسوب می&zwnj;شود. این گوشی، مانند تمامی گوشی&zwnj;های عرضه&zwnj;شده در دیجی&zwnj;کالا، به صورت قانونی و تجاری وارد کشور شده و با رجیستر رسمی، کارت گارانتی معتبر و کد فعال&zwnj;سازی به شما تحویل داده می&zwnj;شود</p>

<p>vbgnfgghjg</p>

<p>&nbsp;dgsdg</p>
',
                'stock' => 456,
                'featured' => 1,
                'discount_duration' => '1996-07-01 00:00:00',
                'seller_id' => 2,
                'category_id' => 5,
                'p_code' => 'dkp-816554',
                'deleted_at' => '2025-10-25 23:42:40',
                'created_at' => '2025-10-25 10:15:35',
                'updated_at' => '2025-10-25 23:42:40',
            ),
        ));
        
        
    }
}